MoseychukA/1-GIT-ReceiverRTL1090/ESP32/Soft/ESP32_RTLSDR_24_12_05_01/librtlsdr.cpp

#include "Arduino.h"
#include "librtlsdr.h"
#include <errno.h>
#include <signal.h>
#include <string.h>
#include <stdio.h>
#include <stdlib.h>
#include "esp_log.h"
//#include "esp32_psram.h"
#include "esp32-hal-psram.h"


#ifndef _WIN32
#include <unistd.h>
#define min(a, b) (((a) < (b)) ? (a) : (b))
#endif

#include "esp_libusb.h"

/* two raised to the power of n */
#define TWO_POW(n) ((double)(1ULL << (n)))

//#include "rtl-sdr.h"
#include "tuner_r82xx.h"


void rtlsdr_set_gpio_bit(rtlsdr_dev_t* dev, uint8_t gpio, int val);
static int rtlsdr_set_if_freq(rtlsdr_dev_t* dev, uint32_t freq);

/* generic tuner interface functions, shall be moved to the tuner implementations */

int r820t_init(void* dev)
{
    rtlsdr_dev_t* devt = (rtlsdr_dev_t*)dev;
    devt->r82xx_p.rtl_dev = dev;

    if (devt->tuner_type == RTLSDR_TUNER_R828D)
    {
        devt->r82xx_c.i2c_addr = R828D_I2C_ADDR;
        devt->r82xx_c.rafael_chip = CHIP_R828D;
    }
    else
    {
        devt->r82xx_c.i2c_addr = R820T_I2C_ADDR;
        devt->r82xx_c.rafael_chip = CHIP_R820T;
    }

    rtlsdr_get_xtal_freq(devt, NULL, &devt->r82xx_c.xtal);

    devt->r82xx_c.max_i2c_msg_len = 8;
    devt->r82xx_c.use_predetect = 0;
    devt->r82xx_p.cfg = &devt->r82xx_c;

    return r82xx_init(&devt->r82xx_p);
}
int r820t_exit(void* dev)
{
    rtlsdr_dev_t* devt = (rtlsdr_dev_t*)dev;
    return r82xx_standby(&devt->r82xx_p);
}

int r820t_set_freq(void* dev, uint32_t freq)
{
    rtlsdr_dev_t* devt = (rtlsdr_dev_t*)dev;
    return r82xx_set_freq(&devt->r82xx_p, freq);
}

int r820t_set_bw(void* dev, int bw)
{
    int r;
    rtlsdr_dev_t* devt = (rtlsdr_dev_t*)dev;

    r = r82xx_set_bandwidth(&devt->r82xx_p, bw, devt->rate);
    if (r < 0)
        return r;
    r = rtlsdr_set_if_freq(devt, r);
    if (r)
        return r;
    return rtlsdr_set_center_freq(devt, devt->freq);
}

int r820t_set_gain(void* dev, int gain)
{
    rtlsdr_dev_t* devt = (rtlsdr_dev_t*)dev;
    return r82xx_set_gain(&devt->r82xx_p, 1, gain);
}
int r820t_set_gain_mode(void* dev, int manual)
{
    rtlsdr_dev_t* devt = (rtlsdr_dev_t*)dev;
    return r82xx_set_gain(&devt->r82xx_p, manual, 0);
}

int rtlsdr_read_array(rtlsdr_dev_t* dev, uint8_t block, uint16_t addr, uint8_t* array, uint8_t len)
{
    uint16_t index = (block << 8);
    unsigned char* data = (unsigned char*)ps_calloc(len, sizeof(char));
    int ret = esp_libusb_control_transfer(dev->driver_obj, CTRL_IN, 0, addr, index, data, len, CTRL_TIMEOUT);
    //fprintf(stderr, "rtlsdr_read_array here %d %d\n", ret, data[0]);
    *array = data[0];
    return ret;
}

int rtlsdr_write_array(rtlsdr_dev_t* dev, uint8_t block, uint16_t addr, uint8_t* array, uint8_t len)
{
    uint16_t index = (block << 8) | 0x10;
    unsigned char* data = (unsigned char*)ps_calloc(len, sizeof(char));
    data[0] = *array;
    int ret = esp_libusb_control_transfer(dev->driver_obj, CTRL_OUT, 0, addr, index, data, len, CTRL_TIMEOUT);
    //fprintf(stderr, "rtlsdr_write_array here %d\n", ret);
    free(data);
    return ret;
}

int rtlsdr_i2c_write_reg(rtlsdr_dev_t* dev, uint8_t i2c_addr, uint8_t reg, uint8_t val)
{
    uint16_t addr = i2c_addr;
    uint8_t data[2];

    data[0] = reg;
    data[1] = val;
    return rtlsdr_write_array(dev, IICB, addr, (uint8_t*)&data, 2);
}

uint8_t rtlsdr_i2c_read_reg(rtlsdr_dev_t* dev, uint8_t i2c_addr, uint8_t reg)
{
    uint16_t addr = i2c_addr;
    uint8_t data = 0;

    rtlsdr_write_array(dev, IICB, addr, &reg, 1);
    rtlsdr_read_array(dev, IICB, addr, &data, 1);

    return data;
}

int rtlsdr_i2c_write(rtlsdr_dev_t* dev, uint8_t i2c_addr, uint8_t* buffer, int len)
{
    uint16_t addr = i2c_addr;

    if (!dev)
        return -1;

    return rtlsdr_write_array(dev, IICB, addr, buffer, len);
}

int rtlsdr_i2c_read(rtlsdr_dev_t* dev, uint8_t i2c_addr, uint8_t* buffer, int len)
{
    uint16_t addr = i2c_addr;

    if (!dev)
        return -1;

    return rtlsdr_read_array(dev, IICB, addr, buffer, len);
}

uint16_t rtlsdr_read_reg(rtlsdr_dev_t* dev, uint8_t block, uint16_t addr, uint8_t len)
{
    unsigned char data[2];
    uint16_t index = (block << 8);
    uint16_t reg;

    int r = esp_libusb_control_transfer(dev->driver_obj, CTRL_IN, 0, addr, index, data, len, CTRL_TIMEOUT);
    fprintf(stderr, "rtlsdr_read_reg here %d\n", r);
    if (r < 0)
        fprintf(stderr, "%s failed\n", __FUNCTION__);

    reg = (data[1] << 8) | data[0];

    return reg;
}

int rtlsdr_write_reg(rtlsdr_dev_t* dev, uint8_t block, uint16_t addr, uint16_t val, uint8_t len)
{
    unsigned char data[2];

    uint16_t index = (block << 8) | 0x10;

    if (len == 1)
        data[0] = val & 0xff;
    else
        data[0] = val >> 8;

    data[1] = val & 0xff;

    int r = esp_libusb_control_transfer(dev->driver_obj, CTRL_OUT, 0, addr, index, data, len, CTRL_TIMEOUT);
   // fprintf(stderr, "rtlsdr_write_reg here %d\n", r);
    if (r < 0)
        fprintf(stderr, "%s failed\n", __FUNCTION__);

    return r;
}

uint16_t rtlsdr_demod_read_reg(rtlsdr_dev_t* dev, uint8_t page, uint16_t addr, uint8_t len)
{
    unsigned char data[2] = { 0, 0 };
    uint16_t index = page;
    uint16_t reg;
    addr = (addr << 8) | 0x20;

    int r = esp_libusb_control_transfer(dev->driver_obj, CTRL_IN, 0, addr, index, data, len, CTRL_TIMEOUT);
    //fprintf(stderr, "rtlsdr_demod_read_reg here %d\n", r);
    if (r < 0)
        fprintf(stderr, "%s failed\n", __FUNCTION__);

    reg = (data[1] << 8) | data[0];

    return reg;
}

int rtlsdr_demod_write_reg(rtlsdr_dev_t* dev, uint8_t page, uint16_t addr, uint16_t val, uint8_t len)
{
    unsigned char data[2];
    uint16_t index = 0x10 | page;
    addr = (addr << 8) | 0x20;

    if (len == 1)
        data[0] = val & 0xff;
    else
        data[0] = val >> 8;

    data[1] = val & 0xff;
    //fprintf(stderr, "rtlsdr_demod_write_reg here\n");
    int r = esp_libusb_control_transfer(dev->driver_obj, CTRL_OUT, 0, addr, index, data, len, CTRL_TIMEOUT);
    if (r < 0)
        fprintf(stderr, "%s failed\n", __FUNCTION__);

    rtlsdr_demod_read_reg(dev, 0x0a, 0x01, 1);

