MoseychukA/1-GIT-ReceiverRTL1090/ESP32/Soft/ESP32_RTLSDR_24_12_05_01/librtlsdr.cpp
    return (r == len) ? 0 : -1;
}

void rtlsdr_set_gpio_bit(rtlsdr_dev_t* dev, uint8_t gpio, int val)
{
    uint16_t r;

    gpio = 1 << gpio;
    r = rtlsdr_read_reg(dev, SYSB, GPO, 1);
    r = val ? (r | gpio) : (r & ~gpio);
    rtlsdr_write_reg(dev, SYSB, GPO, r, 1);
}

void rtlsdr_set_gpio_output(rtlsdr_dev_t* dev, uint8_t gpio)
{
    int r;
    gpio = 1 << gpio;

    r = rtlsdr_read_reg(dev, SYSB, GPD, 1);
    rtlsdr_write_reg(dev, SYSB, GPD, r & ~gpio, 1);
    r = rtlsdr_read_reg(dev, SYSB, GPOE, 1);
    rtlsdr_write_reg(dev, SYSB, GPOE, r | gpio, 1);
}

void rtlsdr_set_i2c_repeater(rtlsdr_dev_t* dev, int on)
{
    rtlsdr_demod_write_reg(dev, 1, 0x01, on ? 0x18 : 0x10, 1);
}

int rtlsdr_set_fir(rtlsdr_dev_t* dev)
{
    uint8_t fir[20];

    int i;
    /* format: int8_t[8] */
    for (i = 0; i < 8; ++i)
    {
        const int val = dev->fir[i];
        if (val < -128 || val > 127)
        {
            return -1;
        }
        fir[i] = val;
    }
    /* format: int12_t[8] */
    for (i = 0; i < 8; i += 2)
    {
        const int val0 = dev->fir[8 + i];
        const int val1 = dev->fir[8 + i + 1];
        if (val0 < -2048 || val0 > 2047 || val1 < -2048 || val1 > 2047)
        {
            return -1;
        }
        fir[8 + i * 3 / 2] = val0 >> 4;
        fir[8 + i * 3 / 2 + 1] = (val0 << 4) | ((val1 >> 8) & 0x0f);
        fir[8 + i * 3 / 2 + 2] = val1;
    }

    for (i = 0; i < (int)sizeof(fir); i++)
    {
        if (rtlsdr_demod_write_reg(dev, 1, 0x1c + i, fir[i], 1))
            return -1;
    }

    return 0;
}

void rtlsdr_init_baseband(rtlsdr_dev_t* dev)
{
    unsigned int i;

    /* initialize USB */
    rtlsdr_write_reg(dev, USBB, USB_SYSCTL, 0x09, 1);
    rtlsdr_write_reg(dev, USBB, USB_EPA_MAXPKT, 0x0002, 2);
    rtlsdr_write_reg(dev, USBB, USB_EPA_CTL, 0x1002, 2);

    /* poweron demod */
    rtlsdr_write_reg(dev, SYSB, DEMOD_CTL_1, 0x22, 1);
    rtlsdr_write_reg(dev, SYSB, DEMOD_CTL, 0xe8, 1);

    /* reset demod (bit 3, soft_rst) */
    rtlsdr_demod_write_reg(dev, 1, 0x01, 0x14, 1);
    rtlsdr_demod_write_reg(dev, 1, 0x01, 0x10, 1);

    /* disable spectrum inversion and adjacent channel rejection */
    rtlsdr_demod_write_reg(dev, 1, 0x15, 0x00, 1);
    rtlsdr_demod_write_reg(dev, 1, 0x16, 0x0000, 2);

    /* clear both DDC shift and IF frequency registers  */
    for (i = 0; i < 6; i++)
        rtlsdr_demod_write_reg(dev, 1, 0x16 + i, 0x00, 1);

    rtlsdr_set_fir(dev);

    /* enable SDR mode, disable DAGC (bit 5) */
    rtlsdr_demod_write_reg(dev, 0, 0x19, 0x05, 1);

    /* init FSM state-holding register */
    rtlsdr_demod_write_reg(dev, 1, 0x93, 0xf0, 1);
    rtlsdr_demod_write_reg(dev, 1, 0x94, 0x0f, 1);

    /* disable AGC (en_dagc, bit 0) (this seems to have no effect) */
    rtlsdr_demod_write_reg(dev, 1, 0x11, 0x00, 1);

    /* disable RF and IF AGC loop */
    rtlsdr_demod_write_reg(dev, 1, 0x04, 0x00, 1);

    /* disable PID filter (enable_PID = 0) */
    rtlsdr_demod_write_reg(dev, 0, 0x61, 0x60, 1);

    /* opt_adc_iq = 0, default ADC_I/ADC_Q datapath */
    rtlsdr_demod_write_reg(dev, 0, 0x06, 0x80, 1);

    /* Enable Zero-IF mode (en_bbin bit), DC cancellation (en_dc_est),
     * IQ estimation/compensation (en_iq_comp, en_iq_est) */
    rtlsdr_demod_write_reg(dev, 1, 0xb1, 0x1b, 1);

    /* disable 4.096 MHz clock output on pin TP_CK0 */
    rtlsdr_demod_write_reg(dev, 0, 0x0d, 0x83, 1);
}

int rtlsdr_deinit_baseband(rtlsdr_dev_t* dev)
{
    int r = 0;

    if (!dev)
        return -1;

    if (dev->tuner && dev->tuner->exit)
    {
        rtlsdr_set_i2c_repeater(dev, 1);
        r = dev->tuner->exit(dev); /* deinitialize tuner */
        rtlsdr_set_i2c_repeater(dev, 0);
    }

    /* poweroff demodulator and ADCs */
    rtlsdr_write_reg(dev, SYSB, DEMOD_CTL, 0x20, 1);

    return r;
}

static int rtlsdr_set_if_freq(rtlsdr_dev_t* dev, uint32_t freq)
{
    uint32_t rtl_xtal;
    int32_t if_freq;
    uint8_t tmp;
    int r;

    if (!dev)
        return -1;

    /* read corrected clock value */
    if (rtlsdr_get_xtal_freq(dev, &rtl_xtal, NULL))
        return -2;

    if_freq = ((freq * TWO_POW(22)) / rtl_xtal) * (-1);

    tmp = (if_freq >> 16) & 0x3f;
    r = rtlsdr_demod_write_reg(dev, 1, 0x19, tmp, 1);
    tmp = (if_freq >> 8) & 0xff;
    r |= rtlsdr_demod_write_reg(dev, 1, 0x1a, tmp, 1);
    tmp = if_freq & 0xff;
    r |= rtlsdr_demod_write_reg(dev, 1, 0x1b, tmp, 1);

    return r;
}

int rtlsdr_set_sample_freq_correction(rtlsdr_dev_t* dev, int ppm)
{
    int r = 0;
    uint8_t tmp;
    int16_t offs = ppm * (-1) * TWO_POW(24) / 1000000;

    tmp = offs & 0xff;
    r |= rtlsdr_demod_write_reg(dev, 1, 0x3f, tmp, 1);
    tmp = (offs >> 8) & 0x3f;
    r |= rtlsdr_demod_write_reg(dev, 1, 0x3e, tmp, 1);

    return r;
}

int rtlsdr_set_xtal_freq(rtlsdr_dev_t* dev, uint32_t rtl_freq, uint32_t tuner_freq)
{
    int r = 0;

    if (!dev)
        return -1;

    if (rtl_freq > 0 &&
        (rtl_freq < MIN_RTL_XTAL_FREQ || rtl_freq > MAX_RTL_XTAL_FREQ))
        return -2;

    if (rtl_freq > 0 && dev->rtl_xtal != rtl_freq)
    {
        dev->rtl_xtal = rtl_freq;

        /* update xtal-dependent settings */
        if (dev->rate)
            r = rtlsdr_set_sample_rate(dev, dev->rate);
    }

    if (dev->tun_xtal != tuner_freq)
    {
        if (0 == tuner_freq)
            dev->tun_xtal = dev->rtl_xtal;
        else
            dev->tun_xtal = tuner_freq;

        /* read corrected clock value into e4k and r82xx structure */
        if (rtlsdr_get_xtal_freq(dev, NULL, &dev->r82xx_c.xtal))
            return -3;

        /* update xtal-dependent settings */
        if (dev->freq)
            r = rtlsdr_set_center_freq(dev, dev->freq);
    }

    return r;
}

int rtlsdr_get_xtal_freq(rtlsdr_dev_t* dev, uint32_t* rtl_freq, uint32_t* tuner_freq)
{
    if (!dev)
        return -1;

#define APPLY_PPM_CORR(val, ppm) (((val) * (1.0 + (ppm) / 1e6)))

    if (rtl_freq)
        *rtl_freq = (uint32_t)APPLY_PPM_CORR(dev->rtl_xtal, dev->corr);

    if (tuner_freq)
        *tuner_freq = (uint32_t)APPLY_PPM_CORR(dev->tun_xtal, dev->corr);

