MoseychukA/1-GIT-ReceiverRTL1090/ESP32/Soft/ESP32_RTLSDR_24_12_05_01/librtlsdr.cpp
    // reg = rtlsdr_i2c_read_reg(dev, R828D_I2C_ADDR, R82XX_CHECK_ADDR);
    // fprintf(stderr, "rtlsdr_i2c_read_reg R828D_I2C_ADDR setting done\n");
    // if (reg == R82XX_CHECK_VAL)
    // {
    //     fprintf(stderr, "Found Rafael Micro R828D tuner\n");
    //     dev->tuner_type = RTLSDR_TUNER_R828D;
    //     goto found;
    // }

 
found:
    /* use the rtl clock value by default */
    dev->tun_xtal = dev->rtl_xtal;
    dev->tuner = &tuners[dev->tuner_type];

    switch (dev->tuner_type)
    {
    case RTLSDR_TUNER_R828D:
        dev->tun_xtal = R828D_XTAL_FREQ;
        /* fall-through */
    case RTLSDR_TUNER_R820T:
        /* disable Zero-IF mode */
        rtlsdr_demod_write_reg(dev, 1, 0xb1, 0x1a, 1);

        /* only enable In-phase ADC input */
        rtlsdr_demod_write_reg(dev, 0, 0x08, 0x4d, 1);

        /* the R82XX use 3.57 MHz IF for the DVB-T 6 MHz mode, and
         * 4.57 MHz for the 8 MHz mode */
        rtlsdr_set_if_freq(dev, R82XX_IF_FREQ);

        /* enable spectrum inversion */
        rtlsdr_demod_write_reg(dev, 1, 0x15, 0x01, 1);
        break;
    case RTLSDR_TUNER_UNKNOWN:
        fprintf(stderr, "No supported tuner found\n");
        rtlsdr_set_direct_sampling(dev, 1);
        break;
    default:
        break;
    }

    if (dev->tuner->init)
        r = dev->tuner->init(dev);

    rtlsdr_set_i2c_repeater(dev, 0);

    *out_dev = dev;

    return 0;
}

int rtlsdr_close(rtlsdr_dev_t* dev)
{
    //     if (!dev)
    //         return -1;

    //     if (!dev->dev_lost)
    //     {
    //         /* block until all async operations have been completed (if any) */
    //         while (RTLSDR_INACTIVE != dev->async_status)
    //         {
    //             usleep(1000);
    //         }

    //         rtlsdr_deinit_baseband(dev);
    //     }

    //     libusb_release_interface(dev->devh, 0);

    // #ifdef DETACH_KERNEL_DRIVER
    //     if (dev->driver_active)
    //     {
    //         if (!libusb_attach_kernel_driver(dev->devh, 0))
    //             fprintf(stderr, "Reattached kernel driver\n");
    //         else
    //             fprintf(stderr, "Reattaching kernel driver failed!\n");
    //     }
    // #endif

    //     libusb_close(dev->devh);

    //     libusb_exit(dev->ctx);

    //     free(dev);

    return 0;
}

int rtlsdr_reset_buffer(rtlsdr_dev_t* dev)
{
    if (!dev)
        return -1;

    rtlsdr_write_reg(dev, USBB, USB_EPA_CTL, 0x1002, 2);
    rtlsdr_write_reg(dev, USBB, USB_EPA_CTL, 0x0000, 2);

    return 0;
}

unsigned char buffer[128];


int rtlsdr_read_sync(rtlsdr_dev_t* dev, void* buf, int len, int* n_read)
{
  //  fprintf(stderr, "addr rtlsdr_read_sync = dev %d\n\n", dev); //Адрес устройства
    if (!dev)
        return -1;

    int esp_ret = esp_libusb_bulk_transfer(dev->driver_obj, 0x81, (unsigned char*)buf, len, n_read, BULK_TIMEOUT);
   // fprintf(stderr, "!!!!esp_ret: %d\n\n", esp_ret); // Результат.
    return esp_ret; //!! esp_libusb_bulk_transfer(dev->driver_obj, 0x81, (unsigned char*)buf, len, n_read, BULK_TIMEOUT);
}

//=========================================================================
 //int rtlsdr_read_async(rtlsdr_dev_t *dev, rtlsdr_read_async_cb_t cb, void *ctx, uint32_t buf_num, uint32_t buf_len)
 //{
 //    unsigned int i;
 //    int r = 0;
 //    struct timeval tv = {1, 0};
 //    struct timeval zerotv = {0, 0};
 //    enum rtlsdr_async_status next_status = RTLSDR_INACTIVE;

 //    if (!dev)
 //        return -1;

 //    if (RTLSDR_INACTIVE != dev->async_status)
 //        return -2;

 //    dev->async_status = RTLSDR_RUNNING;
 //    dev->async_cancel = 0;

 //    dev->cb = cb;
 //    dev->cb_ctx = ctx;

 //    if (buf_num > 0)
 //        dev->xfer_buf_num = buf_num;
 //    else
 //        dev->xfer_buf_num = DEFAULT_BUF_NUMBER;

 //    if (buf_len > 0 && buf_len % 512 == 0) /* len must be multiple of 512 */
 //        dev->xfer_buf_len = buf_len;
 //    else
 //        dev->xfer_buf_len = DEFAULT_BUF_LENGTH;

 //    _rtlsdr_alloc_async_buffers(dev);

 //    for (i = 0; i < dev->xfer_buf_num; ++i)
 //    {
 //        libusb_fill_bulk_transfer(dev->xfer[i],
 //                                  dev->devh,
 //                                  0x81,
 //                                  dev->xfer_buf[i],
 //                                  dev->xfer_buf_len,
 //                                  _libusb_callback,
 //                                  (void *)dev,
 //                                  BULK_TIMEOUT);

 //        r = libusb_submit_transfer(dev->xfer[i]);
 //        if (r < 0)
 //        {
 //            fprintf(stderr, "Failed to submit transfer %i\n"
 //                            "Please increase your allowed "
 //                            "usbfs buffer size with the "
 //                            "following command:\n"
 //                            "echo 0 > /sys/module/usbcore"
 //                            "/parameters/usbfs_memory_mb\n",
 //                    i);
 //            dev->async_status = RTLSDR_CANCELING;
 //            break;
 //        }
 //    }

 //    while (RTLSDR_INACTIVE != dev->async_status)
 //    {
 //        r = libusb_handle_events_timeout_completed(dev->ctx, &tv, &dev->async_cancel);
 //        if (r < 0)
 //        {
 //            /*fprintf(stderr, "handle_events returned: %d\n", r);*/
 //            if (r == LIBUSB_ERROR_INTERRUPTED) /* stray signal */
 //                continue;
 //            break;
 //        }

 //        if (RTLSDR_CANCELING == dev->async_status)
 //        {
 //            next_status = RTLSDR_INACTIVE;

 //            if (!dev->xfer)
 //                break;

 //            for (i = 0; i < dev->xfer_buf_num; ++i)
 //            {
 //                if (!dev->xfer[i])
 //                    continue;

 //                if (LIBUSB_TRANSFER_CANCELLED !=  dev->xfer[i]->status)
 //                {
 //                    r = libusb_cancel_transfer(dev->xfer[i]);
 //                    /* handle events after canceling
 //                     * to allow transfer status to
 //                     * propagate */
 //#ifdef _WIN32
 //                    Sleep(1);
 //#endif
 //                    libusb_handle_events_timeout_completed(dev->ctx,  &zerotv, NULL);
 //                    if (r < 0)
 //                        continue;

