MoseychukA/1-GIT-ReceiverRTL1090/ESP32/Soft/ESP32_RTLSDR_24_12_05_01/librtlsdr.cpp
 //                    next_status = RTLSDR_CANCELING;
 //                }
 //            }

 //            if (dev->dev_lost || RTLSDR_INACTIVE == next_status)
 //            {
 //                /* handle any events that still need to
 //                 * be handled before exiting after we
 //                 * just cancelled all transfers */
 //                libusb_handle_events_timeout_completed(dev->ctx,
 //                                                       &zerotv, NULL);
 //                break;
 //            }
 //        }
 //    }

 //    _rtlsdr_free_async_buffers(dev);

 //    dev->async_status = next_status;

 //    return r;
 //}


//=========================================================================

int rtlsdr_cancel_async(rtlsdr_dev_t* dev)
{
    if (!dev)
        return -1;

    /* if streaming, try to cancel gracefully */
    if (RTLSDR_RUNNING == dev->async_status)
    {
        dev->async_status = RTLSDR_CANCELING;
        dev->async_cancel = 1;
        return 0;
    }

    /* if called while in pending state, change the state forcefully */
#if 0
    if (RTLSDR_INACTIVE != dev->async_status) {
        dev->async_status = RTLSDR_INACTIVE;
        return 0;
    }
#endif
    return -2;
}

uint32_t rtlsdr_get_tuner_clock(void* dev)
{
    uint32_t tuner_freq;

    if (!dev)
        return 0;

    /* read corrected clock value */
    if (rtlsdr_get_xtal_freq((rtlsdr_dev_t*)dev, NULL, &tuner_freq))
        return 0;

    return tuner_freq;
}

int rtlsdr_i2c_write_fn(void* dev, uint8_t addr, uint8_t* buf, int len)
{
    if (dev)
        return rtlsdr_i2c_write(((rtlsdr_dev_t*)dev), addr, buf, len);

    return -1;
}

int rtlsdr_i2c_read_fn(void* dev, uint8_t addr, uint8_t* buf, int len)
{
    if (dev)
        return rtlsdr_i2c_read(((rtlsdr_dev_t*)dev), addr, buf, len);

    return -1;
}

int rtlsdr_set_bias_tee_gpio(rtlsdr_dev_t* dev, int gpio, int on)
{
    if (!dev)
        return -1;

    rtlsdr_set_gpio_output(dev, gpio);
    rtlsdr_set_gpio_bit(dev, gpio, on);

    return 0;
}

int rtlsdr_set_bias_tee(rtlsdr_dev_t* dev, int on)
{
    return rtlsdr_set_bias_tee_gpio(dev, 0, on);
}